{
  "title": "Meet The Big Lebowski's New Website",
  "date": "28.01.2020",
  "description": "We are live. This is not your ordinary website. And we love it.",
  "body": "UX design has become trendy only within the past five or so years. Compared to other professions (even within the design industry), it's a very new term. Over the last 2-3 years, UX design has likely drawn more interest than any other area of design.\n\nEveryone wants to be a UX designer and [every company wants to hire one](https://www.semplice.com/the-ux-designer-hiring-guide). But few know what it means and if they need a UX designer – or if they already have one. Like most trends, there is a lot of talk with little clarity.\n\nAccording to Wikipedia, UX design is defined as \"the process of manipulating user behavior through usability, accessibility, and desirability provided in the interaction with a product.\"\n\nBut how can it be that UX design and its responsibilities gained so much importance within such a short amount of time? Does it mean that previously, before we coined the term \"UX design,\" we didn't care so much about things like usability or desirability? Have we just now discovered the magic of manipulating user behavior?\n\nIf we put our ego aside and be honest with ourselves, none of this is new to design as a whole. UX design simply rebrands certain parts of the general designer's job. This leads to two points of confusion:\n\n1. Newcomers to the design industry are often confused about the responsibilities of UX designers. The difference between this role and other superficially created counterparts (it appears[we invent a new title every other week](https://www.vanschneider.com/truth-design-titles)) is unclear.\n\n2. UX designers seem to be incredibly sensitive and protective of their field. This is likely because it's still a young term, and they feel a certain responsibility to own and advocate for it. It may also be due to friction with other, more traditional senior designers who haven't jumped on the UX train yet – even though that's what they practice.",
  "featured_image": "/img/blog-item.jpg"
}